products/app/controllers/application_controller.rb

  def current_user
    remember_token = User.encrypt(cookies[:user_remember_token])
    @current_user ||= User.find_by(remember_token: remember_token)
---
SELECT  "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT ?  [["remember_token", "14ac109f603e2a2dcd20418932f861ad2446d7c51fef8acdf99ec15e3cf438b3"], ["LIMIT", 1]]

  def sign_in(user)
    remember_token = User.new_remember_token
    cookies.permanent[:user_remember_token] = remember_token
    user.update!(remember_token: User.encrypt(remember_token))
---
UPDATE "users" SET "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_token", "d35a117db3dee82cf31fe790fa917ab9120e79a769fb5dad8375069500c73d2e"], ["updated_at", "2018-10-20 08:40:58.291748"], ["id", 1]]