products/app/controllers/sessions_controller.rb

  def set_user
    @user = User.find_by!(mail: session_params[:mail])
---
SELECT  "users".* FROM "users" WHERE "users"."mail" = ? LIMIT ?  [["mail", "tatsuya@tatsuya.com"], ["LIMIT", 1]]