products/app/controllers/user_infos_controller.rb

SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = ? LIMIT ?  [["user_id", 8], ["LIMIT", 1]]
---
  def new
    @info = UserInfo.find_by(user_id: @current_user.id)

SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = ? LIMIT ?  [["user_id", 8], ["LIMIT", 1]]
---
  def show
    @infos = UserInfo.all

INSERT INTO "user_infos" ("name", "file", "memo", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sasaki"], ["file", "something.jpg"], ["memo", "sasaki"], ["user_id", 1], ["created_at", "2018-10-20 08:41:36.913303"], ["updated_at", "2018-10-20 08:41:36.913303"]]
---
  def create
    @info = UserInfo.new(params.require(:user_info).permit(:name, :file, :user_id, :memo))
    @info.save