products/app/views/user_infos/new.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%= form_for @info, url: profile_path do |f| %>>
<% @user = User.find(@info.user_id.to_i)%>