products/app/views/user_infos/show.html.erb

<p>
  <% @user_info = UserInfo.find_by(user_id: @current_user.id)%>
---
SELECT  "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]